Revit 2026 API

# StructuralConnectionHandlerCreate(Document, IListElementId, String) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StructuralConnectionHandler Create(
	Document document,
	IList<ElementId> elementIds,
	string typeName
)
```
```vb
Public Shared Function Create (
	document As Document,
	elementIds As IList(Of ElementId),
	typeName As String
) As StructuralConnectionHandler
```
```cpp
public:
static StructuralConnectionHandler^ Create(
	Document^ document,
	IList<ElementId^>^ elementIds,
	String^ typeName
)
```
```fsharp
static member Create :
        document : Document *
        elementIds : IList<ElementId> *
        typeName : string -> StructuralConnectionHandler
```

#### Parameters

document Document

elementIds IListElementId

typeName String

#### Return Value

StructuralConnectionHandler

#### Reference

StructuralConnectionHandler Class

Create Overload

Autodesk.Revit.DB.Structure Namespace